# Density Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Density Property
PipePressureDropData Class See Also
---
The density of the pipe. Units: (kg/ft³).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Density { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Density As Double
	Get
```

Visual C++
---
```text
public:
property double Density {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace